# Задание 1 --------------------------------------------------------------


def print_n(n, m=1):
    print(m)
    m += 1
    if m <= n:
        print_n(n, m)


print("Задание_1:")
print_n(23)


# Задание 2 --------------------------------------------------------------


def print_nm(n, m):
    if n < m:
        print(m)
        m -= 1
        if n <= m:
            print_nm(n, m)
    else:
        print(m)
        m += 1
        if m <= n:
            print_nm(n, m)


print("Задание_2:")
print_nm(1, 14)


# Задание 3 --------------------------------------------------------------


def summ(n, m=0):
    m += 1
    if m <= n:
        if m == n:
            return m
        else:
            return m + summ(n, m)


print("Задание_3:")
print(summ(4))


# Задание 4 --------------------------------------------------------------
#
#
#
#
#
